namespace Lessons.Lesson7
{
    /// <summary>
    /// Создать коллекцию напитков и их стоимости для кофе-машины, используя коллекцию Dictionary. Запросите сумму пользователя и сообщите какие напитки доступны для заказа.
    /// 
    /// Спроектируйте базу данных компьютерные курсы.Заполните таблицу, используя операторы SQL.Выведите ФИО студентов, которые учатся на отлично по курсу “Программирование”. Посчитайте таких студентов, используя функцию COUNT.
    /// </summary>
    abstract class Lesson7
    {
        //static void Main()
        //{
        //    //Задание 1
        //    new Task1.Task1();
        //}
    }
}
