namespace Lessons.Lesson6
{
    /// <summary>
    /// 1) Нужно реализовать работу нотариуса по следующему принципу. В бесконечном цикле добавляем элементы с 
    /// именами посетителей в коллекцию нотариус.Когда количество посетителей становится равно 6, нотариус начинает запускать посетителей, информируя, что может войти .... 
    ///
    /// 2) Реализовать паспортный стол.Паспорт содержит 3 свойства – серия, номер, ФИО.Заполнитеь коллекцию рандомным количеством объектов паспортов, которые должны быть созданы следующим образом
    /// а) Генерация серии паспорта происходит либо вручную либо автоматически
    /// б) Генерация номера паспорта происходит автоматически
    /// в) ФИО вводится вручную для каждого паспорта
    /// 
    /// 3*) Реализовать метод поиска ФИО по номеру паспорта

    /// 4) Доработать вывод сообщений в задании с поиском скобок при работе со стэком.Не должно быть дублирующих строк (необязательное задание)
    /// </summary>
    class Lesson6
    {
        static void Main()
        {
            //Задание 1
            //new Task1.Task1();

            //Задание 2
            new Task2.Task2();
        }
    }
}
