namespace Lessons.Lesson8
{
    /// <summary>
    /// Из прошлого урока взять базу данных.Сделать в консоли ввод трех команд –
    /// GET ALL, GET INFO ИМЯ_СТУДЕНТА, DELETE «ИМЯ_СТУДЕНТА». Первая команда – вывод в консоль информации о всех студентах.Вторая команда – вывести информацию о студенте, указанном в команде, третья команда – удалить студента по имени.Удаляем только одного, используйте оператор:
    /// DELETE FROM TABLE WHERE … LIMIT 1

    /// 2.  Создать базовый шаблон сайта Вашей компании, используя блочную верстку. (НЕОБЯЗАТЕЛЬНОЕ ЗАДАНИЕ)
    /// </summary>

    class Lesson8
    {
    }
}
